# Сортування вставкою передбачає пошук потрібного місця
# для заданого елемента у відсортованому списку.
# Спочатку ми порівнюємо перші два елементи і сортуємо їх, порівнюючи.
# Потім ми вибираємо третій елемент і знаходимо його
# правильну позицію серед попередніх двох відсортованих елементів.
# Таким чином ми поступово додаємо нові елементи
# до вже відсортованого списку, розміщуючи їх у потрібному місці.



def insertion_sort(sequence):
    # Починаємо цикл з другого елемента, оскільки перший вважаємо відсортованим
    for index in range(1, len(sequence)):
        position = index - 1  # Створили позицію у списку для подальшого порівняння
        value = sequence[index]  # Зберігаємо значення поточного елемента
        # Поки position не пройде весь список, та наступний елемент списку буде більший за поточний(збережений)
        while position >= 0 and sequence[position] > value:
            sequence[position + 1] = sequence[position]    # Зсуваємо елемент на 1 вправо
            position -= 1  # звільняємо місце під знайдений елемент
        sequence[position + 1] = value    # Вставляємо поточний елемент на знайдену позицію
        # Прінтимо список після кожної ітерації зовнішнього циклу
        print(sequence)
    return sequence

if __name__ == "__main__":
    to_sort = [15, 9, 8, 1, 4, 11, 7, 12, 13, 6, 5, 3, 16, 2, 10, 14]
    print(insertion_sort(to_sort))
