#  суть алгоритму швидкого сортування:
#  Divide: Вибрати центральний елемент та розділити масив на дві частини:
#  ліву (менші елементи) і праву (більші або рівні елементи).
# Conquer: Рекурсивно відсортувати обидві частини.
# Combine: Об'єднати відсортовані частини та центральний елемент у один відсортований масив.



def quick_sort(sequence):
    if len(sequence) <= 1:
        return sequence    # Якщо список містить 1 або менше елементів, він уже відсортований

    pivot = sequence[0]  # Вибираємо перший елемент як центральний (pivot)
    # Формуємо підсписок елементів, менших за центральний
    left = [element for element in sequence[1:] if element < pivot]
    # Формуємо підсписок елементів, більших або рівних центральному
    right = [element for element in sequence[1:] if element >= pivot]
    return quick_sort(left) + [pivot] + quick_sort(right)     # об'єднуємо списки з центральним елементом

if __name__ == "__main__":
    to_sort = [15, 9, 8, 1, 4, 11, 7, 12, 13, 6, 5, 3, 16, 2, 10, 14]
    print(quick_sort(to_sort))
